---
kind: type
id: T:Autodesk.Revit.DB.FamilySizeTableErrorInfo
source: html/5912d43c-de68-a783-d8dd-1526ef9edb02.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorInfo

Error information generated from the CSV file import of a FamilySizeTable.

## Syntax (C#)
```csharp
public class FamilySizeTableErrorInfo : IDisposable
```